app/controllers/search_controller.rb

SELECT "songs".* FROM "songs" WHERE (title LIKE '%my%')
SELECT "albums".* FROM "albums" WHERE (title LIKE '%my%')
SELECT "artists".* FROM "artists" WHERE (name LIKE '%my%')
---
  def index
    @songs = Song.where("title LIKE ?", "%#{params[:search]}%")
    @albums = Album.where("title LIKE ?", "%#{params[:search]}%")
    @artists = Artist.where("name LIKE ?", "%#{params[:search]}%")